(function() {
   angular.module('kafedraApp')
     .controller('AnonsCtrl', function () {
        this.personnel = staff;
     });

   var staff = [{
      name: 'До уваги студентів 5-го курсу',
      biography: '4 жовтня 2016 року на кафедрі германських мов і перекладознавства Інституту іноземних мов відбувся науково-методичний семінар «Лінгвістичні дослідження молодих учених: здобутки і перспективи».
З вітальним словом до учасників семінару звернулася Бабелюк Оксана Андріївна, завідувач кафедри германських мов і перекладознавства, доктор філологічних наук, яка окреслила перспективи розвитку наукової діяльності молодих вчених у реаліях сьогодення.
Далі результати своїх досліджень презентували 11 магістрів, які вже завершують свої кваліфікаційні роботи. На заході були присутні і їхні наукові керівники: доктор філологічних наук, професор Коцюба З.Г., доктор філологічних наук, професор Зимомря М.І., кандидат філологічних наук, доцент Лопушанський Я.М., кандидат філологічних наук, доцент Коваль Н.Є., кандидат філологічних наук, доцент Яскевич О.К. Магістерські роботи охоплювали  найрізноманітнішу тематику. Грунтовними та інформативними були доповіді Міцікевич О. В. про мовні засоби аргументації в англомовному  політичному дискурсі, Шевціва Я. Р. про постмодерністський бібліографічний наратив Пітера Акройда, Шпек А. М. про англійські фразеологізми-зооніми та Ткачик Х. М.  про об’єктивацію жіночих образів у пареміях англійської та української мов. Яскравими у технічному плані та по-своєму цікавими були презентації Момрик М.Б. про психологізм прози П. Зюскінда та Накутної О.М. про драматургію Т. Штоппарда. По завершені кожної доповіді до дискусії долучалися як молоді, так і вже досвідчені науковці.Такий захід, безперечно, стане для магістрів чудовим стимулом до кращої підготовки кваліфікаційного виступу під час державної атестації у січні',
      }, {
      name: 'До уваги студентів 5-го курсу',
      biography: 'Доводимо до Вашого відома, що кваліфікаційні роботи повинні бути подані на кафедру германських мов і перекладознавства до 1 червня 2016 року. Фінальний варіант роботи необхідно узгодити з технічними вимогами на кафедрі германських мов і перекладознавства у старшого лаборанта Бурбан Н.М.',
      }, {
      name: 'Лекції професора Soeren Bo Westring',
      biography: '24-25  травня на соціально-гуманітарному факультеті читатиме лекції професор Soeren Bo Westring (Данія). Тематика лекцій:  «Тема біженців у літературі 20 ст.» (24.05 о 9:00, ауд. 106) та «Гуманізм у творах фламандських живописців 16 ст.»; (25.05 о 9.00, ауд.106). Лекції читатимуться  англійською мовою. Запрошуються студенти та викладачі.',
      }, {
      name: 'Свято науки',
      biography: '11 травня 2016 року у приміщенні Австрійської бібліотеки відбулася студентська наукова конференція «Філологічні науки у ХХI столітті» за ініціативи кафедри германських мов і перекладознавства. Тема привабила близько 30 студентів: бакалаври, студенти 5 курсу, магістри, аспіранти та багато інших охочих долучитися до творчого наукового пошуку молодих науковців. У залі також були присутні і наукові керівники, серед них доктор філологічних наук, професор Бабелюк О.А., кандидати філологічних наук, доценти Палиця Г.С., Яскевич О.К., Коваль Н.Є., Сліпецька В.Д., Летнянчин П.П. За словами організаторів гасло конференції: «Якщо ви володієте знаннями, дайте іншим запалити від нього свої світильники» (Томас Фуллер) цілком відповідало її атмосфері, яка вже з самого початку переросла у дружній «брейн-стормінг» з обох сторін. Наукова дискусія торкалася гендерних аспектів англомовного рекламного дискурсу, поетологічних особливостей психологічної прози, постмодерністської казки, романів Е. Хемінгвея, історичної прози, структури і функцій евфемізмів, рецепції численних перекладів класиків української літератури іноземною мовою.  Конференція завершилася художнім читанням віршів І. Франка німецькою мовою, яке продемонструвала  студентка магістратури заочної форми навчання Мар’яна Кричфалушій.',
      image: 'images/stkon2.jpg',
      image: 'images/stkon1.jpg',
      }, {
      name: 'Cтудентська наукова конференція',
      biography: 'У середу 11.05.2016р. о 10.00  у приміщенні Австрійської бібліотеки відбудеться студентська наукова конференція «Філологічні науки у ХХІ столітті». Запрошуються студенти денної та заочної форм навчання, які виконують кваліфікаційні роботи на кафедрі германських мов і перекладознавства та викладачі кафедри. Для доповіді (5хв.) необхідно роздрукувати зміст роботи, вступ, список літератури та підготувати презентацію.',
      }];

})();
