(function() {
   angular.module('kafedraApp')
     .controller('SkladCtrl', function () {
        this.personnel = staff;
     });

   var staff = [{
      name: 'Бабелюк Оксана Андріївна',
      degree: 'доктор філологічних наук, професор',
      subjects: ['Теоретична граматика (англійська)', 'Стилістика (англійська)', 'Інтерпретація тексту (англійська)', 'Загальнотеоретичний курс другої іноземної мови (англійська)'],
      biography: 'Закінчила Дрогобицький державний педагогічний інститут імені Івана Франка у 1992 р. Кандидат філологічних наук з 12 вересня 1997 року. Дисертацію захистила 12 вересня 1997 року у спеціалізованій вченій раді Київського державного лінгвістичного університету. Вчене звання доцента кафедри англійської філології присвоєно 18 квітня 2002 року. Доктор філологічних наук з 23 лютого 2011 року. Дисертацію захистила 7 жовтня 2010 року у спеціалізованій вченій раді Київського національного лінгвістичного університету. Вчене звання професора кафедри германських мов і перекладознавства присвоєно атестат від 26.10.2012 р. Член двох спеціалізованих рад із захисту кандидатських і докторських дисертацій. З березня 2013 р. головний редактор «Наукового вісника Дрогобицького державного педагогічного університету імені Івана Франка. Серія: Філологічні науки (мовознавство)», який  є фаховим виданням на підставі Наказу МОН України № 1081 від 29 вересня 2014 року. За відповідні наукові здобутки відзначена міжнародним бібліографічним центром "The 20th Century Award for Achievement" – International Biographical Centre, Cambridge, England (1997 р.). Авторка більше 100 публікацій, з них 97 наукового та 6 навчально-методичного характеру, у тому числі 1 монографія, 61стаття  у фахових виданнях України та 1 підручник з грифом МОН України.',
      interests: ''
   }, {
      name: 'Коцюба Зоряна Григорівна',
      degree: 'доктор філологічних наук, професор',
      subjects: ['Типологія', 'Порівняльна типологія української та англійської мов', 'Основи лексикографії', 'Порівняльна лексикологія'],
      biography: 'У 1993 році закінчила Дрогобицький державний педагогічний інститут імені Івана Франка. З 1993 року і до сьогодні працює в цьому інституті (нині університеті) на посадах викладача, доцента, професора. Закінчила стаціонарну аспірантуру у Львівському державному університеті імені Івана Франка, докторантуру – в Інституті мовознавства імені О. О. Потебні НАН України. Кандидат філологічних наук з 2001 року. Кандидатську дисертацію зі спеціальності 10.02.16 – перекладознавство на тему «Експресивність номінативних речень як перекладознавча проблема (на матеріалі англійської та української мов) захистила в Київському національному університеті імені Т. Шевченка. Вчене звання доцента кафедри англійської філології присвоєно 2004 року. Доктор філологічних наук з 2011 року. Докторську дисертацію зі спеціальності 10.02.15 – загальне мовознавство на тему «Універсальне і національне в паремійних фондах мов європейського ареалу (лінгвокультурологічний аспект)» захистила в Київському національному університеті імені Т. Шевченка. Вчене звання професора кафедри германських мов і перекладознавства отримала 2012 року. Член спеціалізованої вченої ради К 35.051.15 у Львівському національному університеті імені Івана Франка. Опублікувала понад 70 праць, із них 67 наукового і 3 навчально-методичного характеру, у тому числі 1 монографія та 1 посібник із грифом МОН України.',
      interests: ''
   }, {
      name: 'Яскевич Ольга Клавдіївна',
      degree: 'кандидат філологічних наук, доцент',
      subjects: ['Контрастивна граматика', 'Теоретична фонетика', 'Країнознавство країни другої іноземної мови', 'Основи теорії мовної комунікації', 'Англійська мова для аспірантів'],
      biography: 'Закінчила Дрогобицький державний педагогічний інститут імені Івана Франка у 1973 р. Кандидат філологічних наук з 18 жовтня  1990 року. Навчалася у аспірантурі на кафедрі англійської філології  при Київському державному університеті імені Тараса Шевченка з 1986-1989 рік. Дисертацію захистила 18 жовтня 1990 року у спеціалізованій вченій раді Київського державного університету ім. Тараса Шевченка. Вчене звання доцента кафедри іноземних мов присвоєно 2 липня 1993 року. Була завідувачем кафедри англійської філології з 2001 по 2009 рік. За відповідні навчальні, наукові та виховні  здобутки відзначена нагрудним знаком «Відмінник  народної освіти України» у 2005 році. Авторка більше 40 публікацій, з них наукового та навчально-методичного характеру.',
      interests: 'порівняльне вивчення лінгвістичних явищ, когнітивна лінгвістика, перекладознавство.'
   }, {
      name: 'Шагала Леся Богданівна',
      degree: 'cтарший викладач',
      subjects: [],
      biography: '1983 - 1988 рр. -  навчання у Дрогобицькому державному педагогічному інституті імені Івана Франка  на факультеті іноземних мов за спеціальністю “Англійська та німецька мови”.  Працювала асистентом, а далі - викладачем, старшим викладачем кафедр англійської мови, практики англійської мови Дрогобицького педінституту (з 1998 р. - Дрогобицького державного педагогічного університету імені Івана Франка), кафедри теорії та практики перекладу. Викладач таких дисциплін: практика усного та писемного мовлення, практична фонетика, практична граматика, теоретична фонетика англійської мови, редагування перекладу. У 1997 р. проходила стажування на курсах для викладачів педагогічних навчальних закладів «Вивчення новітніх методик та практики ТESOL» за участю Дому Америки в Києві. Захист кандидатської дисертації відбувся у спеціалізованій вченій раді у ДДПУ за спеціальністю 13.00.01. – загальна педагогіка та історія педагогіки (2016 р.). За час педагогічної діяльності опубліковано 29 науково-методичних праць, у тому числі 2 монографії ( у співавторстві), 6 статей у фахових виданнях України та 2 статті у зарубіжних виданнях.',
      interests: 'педагогічна діяльність представників українського шкільництва в Польщі, функціонування українських культурно-освітніх осередків в інонаціональному середовищі, проблеми рідномовного навчання та виховання, вивчення іноземних мов різновіковими категоріями учнів.'
   }
   ];

})();
